
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 0 to change, 1 to destroy.</code></pre>

* Replace
  * azurerm_storage_blob.b2c_login_html


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_storage_blob.b2c_login_html must be replaced
-/+ resource "azurerm_storage_blob" "b2c_login_html" {
      ~ access_tier            = "Hot" -> (known after apply)
      ~ content_md5            = "2d9dd23510b325ec54b12e22544e87c8" -> "9d31c8be82d017671e25bf23c5747d2d" # forces replacement
      ~ id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/login.html" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
        name                   = "login.html"
      ~ url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/login.html" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":718,"Program":"tfcmt","SHA1":"","Vars":{}} -->